Repository: AhmedAtaar/Team3_CAI3_SWD8_G1_AutoSpare
Catalog: lib/l10n/app_*.arb
Languages: ar

# orderSummaryCouponApplyButton
source: Apply
ar: تطبيق

# orderSummaryNoteFieldLabel
source: Order note (optional)
ar: ملاحظة للطلب (اختياري)

# orderSummarySubmittingLabel
source: Creating order...
ar: جارٍ إنشاء الطلب...

# orderSummarySubmitButton
source: Place order
ar: إتمام الطلب

# categoryTileItemCountPrefix
source: Products:
ar: عدد المنتجات:

# productCardAddToCartTooltip
source: Add to cart
ar: أضف إلى السلة

# authOrDividerLabel
source: or
ar: أو

# adminTowRequestsErrorLoading
source: An error occurred while loading tow requests:
ar: حدث خطأ أثناء تحميل طلبات السحب:

# adminTowRequestsEmpty
source: There are no tow requests yet.
ar: لا توجد طلبات سحب مسجلة حتى الآن

# adminTowRequestsItemTitlePrefix
source: Request
ar: طلب

# adminTowRequestsCompanyPrefix
source: Company:
ar: الشركة:

# adminTowRequestsStatusPrefix
source: Status:
ar: الحالة:

# adminTowRequestsVehiclePlatePrefix
source: Vehicle / plate:
ar: المركبة / اللوحة:

# adminTowRequestsPhonePrefix
source: Phone:
ar: الهاتف:

# adminTowRequestsTotalCostPrefix
source: Total service:
ar: إجمالي الخدمة:

# adminTowRequestsFromPrefix
source: From:
ar: من:

# adminTowRequestsToPrefix
source: To:
ar: إلى:

# adminTowRequestsProblemPrefix
source: Problem:
ar: الوصف:

# adminWinchAccountsErrorLoading
source: Error loading tow accounts:
ar: خطأ في تحميل حسابات الأوناش:

# adminWinchAccountsEmpty
source: No tow accounts have been registered yet.
ar: لا توجد حسابات أوناش مسجلة حتى الآن

# adminWinchAccountsNoName
source: No name
ar: بدون اسم

# adminWinchAccountsNoArea
source: No area
ar: بدون منطقة

# adminWinchAccountsOnlineLabel
source: Online
ar: مُفعّل

# adminWinchAccountsOfflineLabel
source: Offline
ar: مُعطّل

# adminWinchAccountsDeleteTitle
source: Delete tow account
ar: حذف حساب الونش

# adminWinchAccountsDeleteMessage
source: Are you sure you want to permanently delete account "{name}"?
ar: هل أنت متأكد من حذف حساب "{name}" نهائيًا؟

# adminWinchAccountsDeleteConfirm
source: Confirm delete
ar: تأكيد الحذف

# adminWinchAccountsDeleteMenu
source: Delete account
ar: حذف الحساب

# adminWinchAccountsDeleteSuccess
source: Account {name} has been deleted
ar: تم حذف حساب {name}

# adminWinchAccountsAreaPrefix
source: Area:
ar: المنطقة:

# adminWinchAccountsBaseCostPrefix
source: Base service price:
ar: سعر الخدمة الأساسية:

# adminWinchAccountsPricePerKmPrefix
source: Price per km:
ar: سعر الكيلو:

# adminWinchAccountsPhonePrefix
source: Phone:
ar: رقم الهاتف:

# adminOrdersErrorLoadingPrefix
source: Error loading orders:
ar: حدث خطأ أثناء تحميل الطلبات:

# adminOrdersRangePickerHelp
source: Select date range
ar: اختيار مدة زمنية

# adminOrdersRangePickerSave
source: Apply
ar: اختيار

# adminOrdersSearchHint
source: Search: code / buyer / seller / product…
ar: بحث: كود/مشتري/بائع/منتج…

# adminOrdersClearSearchTooltip
source: Clear
ar: مسح

# adminOrdersRangeAllLabel
source: Range: All
ar: المدة: الكل

# adminOrdersPaginationRemoveRangeTooltip
source: Clear range
ar: إزالة المدة

# adminOrdersPaginationNextTooltip
source: Next page
ar: التالي

# adminOrdersSortCreatedDesc
source: Newest first
ar: الأحدث أولاً

# adminOrdersSortCreatedAsc
source: Oldest first
ar: الأقدم أولاً

# adminOrdersSortTotalDesc
source: Amount: highest ↓
ar: المبلغ: الأعلى ↓

# adminOrdersSortTotalAsc
source: Amount: lowest ↑
ar: المبلغ: الأقل ↑

# adminOrdersResetFiltersButton
source: Reset filters
ar: إعادة الضبط

# adminOrdersMatchingCountPrefix
source: Matching orders:
ar: عدد الطلبات المطابقة:

# adminOrdersNoMatchingMessage
source: No matching orders
ar: لا توجد طلبات مطابقة

# adminOrdersBuyerPrefix
source: Buyer:
ar: العميل:

# adminOrdersItemsCountPrefix
source: Items:
ar: عناصر:

# adminOrdersGrandTotalPrefix
source: Total:
ar: الإجمالي:

# adminOrdersGeoAddressPrefix
source: Geo address:
ar: العنوان الجغرافي:

# adminOrdersTotalFooterPrefix
source: Total:
ar: الإجمالي:

# adminOrdersPaginationFirstTooltip
source: First page
ar: الأولى

# adminOrdersPaginationPrevTooltip
source: Previous page
ar: السابق

# adminOrdersPaginationLastTooltip
source: Last page
ar: الأخيرة

# adminOrdersPageLabel
source: Page
ar: صفحة

# sellerInventoryRestockDialogTitlePrefix
source: Restock
ar: زيادة مخزون

# sellerInventoryRestockQuantityLabel
source: Quantity to add
ar: الكمية المطلوب إضافتها

# sellerInventoryRestockQuantityInvalidError
source: Enter a valid number greater than zero
ar: أدخل رقمًا صحيحًا أكبر من صفر

# sellerInventoryRestockQuantityTooBigError
source: Value is too large
ar: قيمة كبيرة جدًا

# sellerInventoryRestockAddButton
source: Add
ar: إضافة

# sellerInventoryRestockSuccessPrefix
source: Added
ar: تمت إضافة

# sellerInventoryRestockSuccessInfix
source: to the stock of
ar: إلى مخزون

# sellerInventoryRestockErrorPrefix
source: Failed to update stock:
ar: تعذر تعديل المخزون:

# sellerInventoryErrorLoading
source: Error loading products
ar: حدث خطأ أثناء تحميل المنتجات

# sellerInventoryEmptyForSeller
source: No approved products for this seller yet
ar: لا توجد منتجات مقبولة لهذا البائع حتى الآن

# sellerInventoryTotalStockPrefix
source: Total stock:
ar: إجمالي المخزون:

# sellerInventoryTotalSoldPrefix
source: Total sold:
ar: إجمالي المبيعات:

# sellerInventoryTotalRevenuePrefix
source: Total revenue:
ar: الإيراد الكلي:

# sellerInventoryEditStockTooltip
source: Edit stock
ar: تعديل المخزون

# sellerInventoryStockPrefix
source: Stock:
ar: المخزون:

# sellerInventorySoldPrefix
source: Sold:
ar: المباع:

# sellerInventoryRevenuePrefix
source: Revenue:
ar: الإيراد:

# sellerInventoryPricePrefix
source: Price:
ar: السعر:

# sellerInventoryYearsPrefix
source: Fit years:
ar: سنوات الملاءمة:

# productReviewsTitle
source: Reviews
ar: التقييمات

# productReviewsProductTitle
source: Product reviews
ar: مراجعات المنتج

# productReviewsSellerTitle
source: Seller reviews
ar: مراجعات البائع

# productReviewsNoProductReviewsMessage
source: No reviews for this product yet
ar: لا توجد مراجعات للمنتج بعد

# productReviewsNoSellerReviewsMessage
source: No reviews for this seller yet
ar: لا توجد مراجعات للبائع بعد

# productReviewsBuyerPrefix
source: Buyer:
ar: المشتري:

# catalogCanFulfillItemNotFound
source: Item "{name}" is not available in the catalog.
ar: العنصر "{name}" غير موجود في الكتالوج.

# catalogCanFulfillInsufficientStock
source: Current stock of "{name}" is only {stock}.
ar: المخزون الحالي من "{name}" هو {stock} فقط.

# orderStatusProcessing
source: Processing
ar: قيد المعالجة

# orderStatusPrepared
source: Prepared
ar: تم التجهيز

# orderStatusHandedToCourier
source: Handed to courier
ar: مع شركة الشحن

# orderStatusDelivered
source: Delivered
ar: تم الاستلام

# orderStatusCancelled
source: Cancelled
ar: أُلغي

# towStatusPending
source: Pending review
ar: قيد المراجعة

# towStatusAccepted
source: Accepted
ar: مقبول

# towStatusOnTheWay
source: On the way
ar: في الطريق

# towStatusCompleted
source: Service completed
ar: تمت الخدمة

# towStatusCancelled
source: Cancelled
ar: ملغي

# towStatusRejected
source: Rejected
ar: مرفوض

# adminWinchTabWinchTitlePrefix
source: Tow:
ar: الونش:

# adminWinchTabStatusPrefix
source: Status:
ar: الحالة:

# adminWinchTabStatusApproved
source: Approved
ar: مقبول

# adminWinchTabStatusPending
source: Pending review
ar: في انتظار المراجعة

# adminWinchTabMaxWinchesPrefix
source: Allowed tow trucks:
ar: عدد الأوناش المسموح:

# adminWinchTabDocsTitle
source: Documents:
ar: المستندات:

# adminWinchTabMenuTooltip
source: Actions
ar: إجراءات

# adminWinchTabMenuApproveLabel
source: Approve & set capacity
ar: قبول وتحديد عدد الأوناش

# adminWinchTabApproveSuccess
source: Tow account approved with capacity = {capacity}
ar: تم قبول حساب الونش وتحديد عدد الأوناش = {capacity}

# adminWinchTabCapacityDialogTitle
source: Set number of tow trucks in service
ar: حدد عدد الأوناش في الخدمة

# adminWinchTabCapacityFieldLabel
source: Number of tow trucks
ar: عدد الأوناش

# adminWinchTabDialogSave
source: Save
ar: حفظ
