Repository: AhmedAtaar/Team3_CAI3_SWD8_G1_AutoSpare
Catalog: lib/l10n/app_*.arb
Languages: ar

# seller_coupons_created_snackbar_prefix
source: Coupon created
ar: تم إنشاء الكود

# seller_coupons_create_dialog_title
source: Create coupon
ar: إنشاء كود خصم

# seller_coupons_code_label
source: Code (example: SAVE10)
ar: الكود (مثال: SAVE10)

# seller_coupons_code_required_error
source: Required
ar: مطلوب

# seller_coupons_code_no_spaces_error
source: Code must not contain spaces
ar: الكود لا يجب أن يحتوي مسافات

# seller_coupons_percent_label
source: Discount %
ar: نسبة الخصم %

# seller_coupons_percent_required_error
source: Required
ar: مطلوب

# seller_coupons_percent_invalid_error
source: Enter a value between 1 and 100
ar: أدخل نسبة بين 1 و 100

# seller_coupons_days_label
source: Validity in days (optional)
ar: مدة الصلاحية بالأيام (اختياري)

# seller_coupons_days_hint
source: Leave empty for no expiry
ar: اتركه فارغ بدون انتهاء

# seller_coupons_form_cancel_button
source: Cancel
ar: إلغاء

# seller_coupons_form_save_button
source: Save
ar: حفظ

# currencyEgp
source: EGP
ar: جنيه

# adminEarningsLastUpdatedPrefix
source: Last updated:
ar: آخر تحديث:

# sellerDashboardAllTime
source: All time
ar: كل الوقت

# sellerDashboardRangeFromPrefix
source: From
ar: من

# sellerDashboardRangeToPrefix
source: to
ar: إلى

# sellerDashboardDateRangeHelp
source: Select period to view your earnings
ar: اختر الفترة لعرض أرباحك

# sellerDashboardDateRangeCancel
source: Cancel
ar: إلغاء

# sellerDashboardDateRangeConfirm
source: Apply
ar: تم

# sellerDashboardTitle
source: Seller dashboard
ar: لوحة تحكم البائع

# sellerDashboardUnknownSellerMessage
source: Unable to determine seller identity for this account.
ar: لا يمكن تحديد هوية البائع لهذا الحساب

# sellerDashboardErrorLoadingOrders
source: An error occurred while loading orders.
ar: حدث خطأ أثناء تحميل الطلبات

# sellerDashboardNoCompletedOrders
source: There are no completed orders yet.
ar: لا توجد طلبات مكتملة حتى الآن

# sellerDashboardNoOrdersInRange
source: There are no orders in the selected period. Try changing the date range.
ar: لا توجد طلبات في الفترة المختارة. حاول تغيير فترة التاريخ.

# sellerDashboardStatOrdersInPeriodTitle
source: Completed orders (in period)
ar: عدد الطلبات المكتملة (في الفترة)

# sellerDashboardStatItemsSoldTitle
source: Total items sold
ar: إجمالي القطع المباعة

# sellerDashboardStatItemsTotalTitle
source: Items value (before discount)
ar: قيمة المنتجات (قبل الخصم)

# sellerDashboardStatItemsTotalSubtitle
source: Based only on the prices you entered for products
ar: حسب السعر الذي أدخلته في المنتجات فقط

# sellerDashboardStatDiscountTotalTitle
source: Total discounts on your items
ar: إجمالي الخصومات على منتجاتك

# sellerDashboardStatDiscountTotalSubtitle
source: Includes discounts and coupons in the period
ar: تشمل الخصومات والكوبونات في الفترة

# sellerDashboardStatNetInPeriodTitle
source: Net earnings after discounts (in period)
ar: صافي أرباحك بعد الخصم (في الفترة)

# sellerDashboardStatNetInPeriodSubtitle
source: Does not include app commission 5% (charged to buyer)
ar: لا يشمل عمولة التطبيق ٥٪ (هذه محسوبة على المشتري)

# sellerDashboardChartSectionTitle
source: Net earnings distribution by day
ar: توزيع صافي أرباحك حسب الأيام

# sellerDashboardChartNoData
source: Not enough data to draw a chart in the selected period.
ar: لا توجد بيانات كافية للرسم في الفترة المحددة

# sellerDashboardChartTitle
source: Your net earnings by day
ar: صافي أرباحك موزعة على الأيام

# sellerDashboardCouponsSectionTitle
source: Coupon impact on your earnings (in period)
ar: تأثير أكواد الخصم على أرباحك (في الفترة)

# sellerDashboardCouponsTotalLabel
source: Total coupon discounts on your items in the selected period:
ar: إجمالي الخصم الناتج عن الكوبونات على منتجاتك في الفترة المحددة:

# sellerDashboardCouponsEmptyMessage
source: No coupon codes were used on your items in the selected period.
ar: لم يتم استخدام أي أكواد خصم على منتجاتك في الفترة المحددة.

# sellerDashboardSummaryTitle
source: Your store earnings summary
ar: ملخص أرباح متجرك

# sellerDashboardSummaryDesc
source: All figures below are calculated from the original prices you entered for products before adding the 5% app commission.
ar: كل الأرقام في الأسفل محسوبة على أساس السعر الأصلي الذي تقوم بإدخاله في المنتجات قبل زيادة عمولة التطبيق ٥٪.

# sellerDashboardTotalNetAllTimeLabel
source: Net earnings (all time)
ar: صافي أرباحك (كل الوقت)

# sellerDashboardChangePeriodButton
source: Change period
ar: تغيير الفترة

# sellerDashboardAllTimeButton
source: All time
ar: كل الوقت

# sellerOrderTimelineCreated
source: Created
ar: أُنشئ

# sellerOrderTimelinePrepared
source: Prepared
ar: تم التجهيز

# sellerOrderTimelineWithCourier
source: With courier
ar: مع الشحن

# sellerOrderTimelineDelivered
source: Delivered
ar: تم الاستلام

# sellerOrderTimelineCancelled
source: Cancelled
ar: أُلغي

# sellerOrderDetailsTitle
source: Order details
ar: تفاصيل الطلب

# sellerOrderDetailsOrderCodePrefix
source: Order code:
ar: كود الطلب:

# sellerOrderDetailsBuyerPrefix
source: Buyer:
ar: المشتري:

# sellerOrderDetailsCreatedAtPrefix
source: Created at:
ar: تاريخ الإنشاء:

# sellerOrderDetailsCouponUsedPrefix
source: Coupon used:
ar: كود الخصم المستخدم:

# sellerOrderDetailsBuyerNoteTitle
source: Buyer note:
ar: ملاحظة المشتري:

# sellerOrderDetailsFinancialSummaryTitle
source: Order financial summary
ar: ملخص مالي للطلب

# sellerOrderDetailsTotalItemsAllSellersLabel
source: Items total (all sellers)
ar: إجمالي المنتجات (كل البائعين)

# sellerOrderDetailsShippingLabel
source: Shipping
ar: الشحن

# sellerOrderDetailsTotalDiscountLabel
source: Total discount
ar: إجمالي الخصم

# sellerOrderDetailsGrandTotalLabel
source: Order grand total
ar: الإجمالي النهائي للطلب

# sellerOrderDetailsSellerSectionTitle
source: Seller-specific summary
ar: بيانات خاصة بك كبائع

# sellerOrderDetailsSellerItemsCountLabel
source: Your items count
ar: عدد العناصر التابعة لك

# sellerOrderDetailsSellerSubtotalLabel
source: Your items subtotal (before discount)
ar: سعر منتجاتك قبل الخصم

# sellerOrderDetailsSellerDiscountShareLabel
source: Your share of discount
ar: نصيبك من الخصم

# sellerOrderDetailsSellerNetLabel
source: Net value of your items in this order
ar: صافي قيمة منتجاتك في هذا الطلب

# sellerOrderDetailsCoordsPrefix
source: Coordinates:
ar: الإحداثيات:

# sellerOrderDetailsItemsSectionTitle
source: Your order items
ar: بنود الطلب الخاصة بك

# sellerOrderDetailsNoItemsForSellerMessage
source: There are no items assigned to you in this order.
ar: لا توجد عناصر مرتبطة بك في هذا الطلب.

# sellerOrderDetailsUnitPricePrefix
source: Unit price:
ar: سعر الوحدة:

# sellerOrdersTitle
source: Customer orders
ar: طلبات العملاء

# sellerOrdersNoOrdersMessage
source: There are no orders at the moment.
ar: لا توجد طلبات حالياً

# sellerOrdersUpdateStatusSuccessPrefix
source: Order status updated to
ar: تم تحديث حالة الطلب إلى

# sellerOrdersUpdateStatusErrorPrefix
source: Failed to update status:
ar: تعذّر تحديث الحالة:

# sellerOrdersNoAvailableStatusesMenuLabel
source: No available statuses
ar: لا توجد حالات متاحة

# sellerOrdersStatusChangeNotAllowedTooltip
source: Status cannot be changed
ar: لا يمكن تغيير الحالة

# sellerOrdersStatusChangeTooltip
source: Update order status
ar: تحديث حالة الطلب

# sellerOrdersSubtitleItemsPrefix
source: Items:
ar: عناصر:

# sellerOrdersSubtitleNetPrefix
source: • Your net earnings from order:
ar: • صافي أرباحك من الطلب:

# sellerOrdersFilterByStatusLabel
source: Filter by status:
ar: تصفية بالحالة:

# sellerOrdersFilterAllLabel
source: All
ar: الكل

# sellerOrdersFinalPricePrefix
source: Final price:
ar: السعر النهائي:

# sellerProfileNewProductSheetTitle
source: Add new product
ar: إضافة منتج جديد

# sellerProfileNewProductTitleLabel
source: Product name (example: Front headlight)
ar: اسم المنتج (مثال: فانوس أمامي)

# sellerProfileNewProductPriceLabel
source: Price
ar: السعر

# sellerProfileNewProductDescLabel
source: Description (example: Fits 2023–2025 same shape)
ar: الوصف (مثال: يصلح لأعوام 2023-2025 نفس الشكل)

# sellerProfileNewProductBrandLabel
source: Brand
ar: البراند

# sellerProfileNewProductModelLabel
source: Model
ar: الموديل

# sellerProfileNewProductYearsLabel
source: Compatible years
ar: السنوات المناسبة

# sellerProfileNewProductStockLabel
source: Available stock
ar: المخزون المتاح

# sellerProfileNewProductImageLabel
source: Image URL (optional)
ar: رابط الصورة (اختياري)

# sellerProfileFieldRequiredError
source: Required
ar: مطلوب

# sellerProfileNewProductPriceInvalidError
source: Invalid price
ar: سعر غير صالح

# sellerProfileNewProductStockInvalidError
source: Invalid value
ar: قيمة غير صالحة

# sellerProfileNewProductSelectYearSnack
source: Please select at least one year
ar: اختر سنة واحدة على الأقل

# sellerProfileNewProductSubmittedSnack
source: Product submitted for review
ar: تم إرسال المنتج للمراجعة

# sellerProfileNewProductSaveErrorPrefix
source: Error while saving product:
ar: حصل خطأ أثناء حفظ المنتج:

# sellerProfileNewProductSubmitButton
source: Submit for review
ar: إرسال للمراجعة

# sellerProfileNewProductInfoTitle
source: Important note:
ar: معلومة هامة:

# sellerProfileNewProductInfoBody
source: The price you enter here is the seller price before the app commission. An app commission of {percent}% will be added automatically when the product is shown to the buyer and in the cart.
ar: السعر الذي تقوم بإدخاله هنا هو سعر البائع قبل عمولة التطبيق. سيتم إضافة عمولة للتطبيق بنسبة {percent}% تلقائياً عند عرض المنتج للمشتري وفي السلة.

# sellerProfileNoProductsInTabMessage
source: There are no products in this tab yet.
ar: لا توجد منتجات في هذا التبويب حالياً

# sellerProfileProductBrandPrefix
source: Brand:
ar: الماركة:

# sellerProfileProductModelPrefix
source: Model:
ar: الموديل:

# sellerProfileProductPricePrefix
source: Price:
ar: السعر:

# sellerProfileProductStockPrefix
source: Stock:
ar: المخزون:

# sellerProfileProductStatusApprovedLabel
source: Approved
ar: مقبول

# sellerProfileProductStatusPendingLabel
source: Pending
ar: قيد المراجعة

# sellerProfileProductStatusRejectedLabel
source: Rejected
ar: مرفوض

# sellerProfileAddProductButton
source: Add product
ar: إضافة منتج

# sellerProfileTabPending
source: Pending
ar: قيد المراجعة

# sellerProfileTabApproved
source: Approved
ar: المقبولة

# sellerProfileTabRejected
source: Rejected
ar: المرفوضة

# sellerProfileErrorLoadingProducts
source: An error occurred while loading products.
ar: حدث خطأ أثناء تحميل المنتجات

# sellerProfileDashboardButtonLabel
source: Dashboard & earnings
ar: لوحة التحكم و الأرباح

# sellerProfileOrdersButtonLabel
source: Customer orders
ar: طلبات العملاء

# sellerProfileInventoryButtonLabel
source: Inventory management
ar: إدارة المخزون

# sellerProfileCouponsButtonLabel
source: Discount coupons
ar: أكواد الخصم

# sellerProfileInventoryScreenTitle
source: Inventory management
ar: إدارة المخزون

# sellerProfileRejectedEmptyMessage
source: There are no rejected products at the moment.
ar: لا توجد منتجات مرفوضة حالياً

# sellerProfileRejectedPricePrefix
source: Price:
ar: السعر:

# sellerProfileRejectedReasonUnknown
source: Rejection reason not specified
ar: سبب الرفض غير محدد

# sellerProfileRejectedReasonPrefix
source: Rejection reason:
ar: سبب الرفض:

# towCompaniesAppBarTitle
source: Nearby tow companies
ar: شركات السحب القريبة

# towCompaniesEmptyMessage
source: There are no tow companies available at the moment.
ar: لا توجد شركات متاحة حالياً

# towCompaniesStatusAvailable
source: Available
ar: متاح

# towCompaniesStatusUnavailable
source: Unavailable
ar: غير متاح

# towCompaniesDistancePrefix
source: Approximate distance:
ar: المسافة التقريبية:

# towCompaniesKmSuffix
source: km
ar: كم

# towCompaniesBaseCostPrefix
source: Base service price:
ar: سعر الخدمة:

# towCompaniesPricePerKmPrefix
source: Price per km:
ar: سعر الكيلو:

# towCompaniesCoordsPrefix
source: Location (lat, lng):
ar: الإحداثيات:

# towLocationPickerAppBarTitle
source: Pick location
ar: اختيار اللوكيشن

# towLocationPickerUseMyLocationButton
source: Use my location
ar: استخدام موقعي الآن

# towLocationPickerChooseFromMapButton
source: Choose from map
ar: اختيار من الخريطة

# towLocationPickerLatitudeLabel
source: Latitude
ar: خط العرض (Latitude)

# towLocationPickerLongitudeLabel
source: Longitude
ar: خط الطول (Longitude)

# towLocationPickerSaveButton
source: Save
ar: حفظ

# towLocationPickerHintText
source: Use your current location or open the map to pick a point.
ar: اختر موقعك الحالي أو افتح الخريطة لتحديد النقطة.

# towLocationPickerServiceDisabledSnack
source: Enable location services first
ar: فعّل خدمات الموقع أولًا

# towLocationPickerPermissionDeniedSnack
source: Location permission denied
ar: تم رفض إذن الموقع

# towLocationPickerPermissionDeniedForeverSnack
source: Location permission is permanently denied
ar: إذن الموقع مرفوض دائمًا

# towLocationPickerInvalidCoordsSnack
source: Enter valid coordinates
ar: أدخل إحداثيات صحيحة

# towMapPickerAppBarTitle
source: Choose from map
ar: اختيار من الخريطة

# towMapPickerDoneActionLabel
source: Done
ar: تم

# towMapPickerDoneButtonLabel
source: Use this point
ar: اختيار هذه النقطة

# towMapOpenErrorSnack
source: Could not open the map
ar: تعذّر فتح الخريطة

# towOperatorAppBarTitle
source: Tow panel
ar: لوحة الونش

# towOperatorAppBarTitleWithName
source: {companyName} panel
ar: لوحة {companyName}

# towOperatorCompanyNotFoundMessage
source: Could not find the tow company linked to this account. It may have been deleted or not configured correctly.
ar: تعذّر العثور على شركة الونش المرتبطة بهذا الحساب. قد تكون الشركة محذوفة أو لم يتم إعدادها بشكل صحيح.

# towOperatorToggleOnlineTooltipOn
source: Stop receiving requests
ar: إيقاف استقبال الطلبات

# towOperatorToggleOnlineTooltipOff
source: Start receiving requests
ar: تفعيل استقبال الطلبات

# towOperatorTabActive
source: Active
ar: طلبات جارية

# towOperatorTabHistory
source: History
ar: منتهية

# towOperatorCoordsPrefix
source: Coordinates:
ar: الإحداثيات:

# towOperatorStatusOnlineLabel
source: Online • receiving requests
ar: متصل • يستقبل طلبات

# towOperatorStatusOfflineLabel
source: Offline
ar: غير متصل

# towOperatorOnlineSwitchTitle
source: Available now (online)
ar: متاح الآن (Online)

# towOperatorOnlineSwitchSubtitle
source: Customers can see your company and book
ar: يمكن للعملاء رؤية شركتك والحجز

# towOperatorOfflineWarning
source: You are currently offline. Turn online to appear for nearby customers.
ar: أنت خارج الخدمة حاليًا. فعّل الحالة لتظهر لعملائك القريبين.

# towOperatorNoRequestsYet
source: There are no requests yet.
ar: لا توجد طلبات حتى الآن

# towOperatorActiveEmpty
source: There are no active requests at the moment.
ar: لا توجد طلبات جارية حاليًا

# towOperatorHistoryEmpty
source: There are no completed requests yet.
ar: لا توجد طلبات منتهية حتى الآن

# towOperatorToggleButtonToOffline
source: Set as unavailable
ar: تحويل إلى غير متاح

# towOperatorToggleButtonToOnline
source: Set as available
ar: تحويل إلى متاح

# towOperatorRequestVehicleFallback
source: Vehicle (no description)
ar: مركبة بدون وصف

# towOperatorRequestStatusNewSuffix
source: • New
ar: • جديد

# towOperatorRequestFromPrefix
source: From:
ar: من:

# towOperatorRequestToPrefix
source: To:
ar: إلى:

# towOperatorRequestToUnknown
source: Not specified
ar: غير محدد

# towOperatorRequestTotalPrefix
source: Total service cost:
ar: إجمالي الخدمة:

# towOperatorRequestPhonePrefix
source: Phone:
ar: الهاتف:

# towOperatorRequestClientLocationButton
source: Client location
ar: موقع العميل

# towOperatorRequestDestinationLocationButton
source: Drop-off location
ar: مكان التسليم

# towOperatorMenuAccept
source: Accept request
ar: قبول الطلب

# towOperatorMenuOnWay
source: On the way
ar: في الطريق

# towOperatorMenuDone
source: Service completed
ar: تمت الخدمة

# towOperatorMenuCancel
source: Cancel
ar: إلغاء

# towUnitKm
source: km
ar: كم

# currencyEgpShort
source: EGP
ar: ج

# towScreenTitle
source: Emergency tow service
ar: خدمة سحب عاجلة

# towScreenGpsEnableSnack
source: Please enable location (GPS) from settings
ar: من فضلك فعّل خدمة الموقع (GPS) من الإعدادات

# towScreenLocationPermissionDeniedSnack
source: Location permission denied
ar: تم رفض صلاحية الموقع

# towScreenLocationFetchErrorSnack
source: Failed to get location:
ar: تعذّر جلب الموقع:

# towScreenLocationNotSetSnack
source: Your location has not been set yet
ar: لم يتم تحديد موقعك بعد

# towScreenSelectCompanySnack
source: Please choose a tow company
ar: من فضلك اختر شركة سحب

# towScreenLoginRequiredSnack
source: You must be logged in before requesting a tow
ar: يجب تسجيل الدخول قبل طلب الونش

# towScreenActiveTowExistsTitle
source: Active tow request
ar: يوجد طلب سحب مفتوح

# towScreenActiveTowExistsBody
source: You already have an active tow request. You cannot create a new request before finishing or cancelling the current one from your account page (Tow requests section).
ar: يوجد لديك طلب سحب جارٍ حالياً. لا يمكنك إنشاء طلب جديد قبل إنهاء أو إلغاء الطلب الحالي من صفحة حسابك (قسم طلبات الونش).

# towScreenConfirmDialogTitle
source: Confirm request
ar: تأكيد الطلب

# towScreenConfirmCompanyLabel
source: Company:
ar: الشركة:

# towScreenConfirmMyLocationLabel
source: My location:
ar: موقعي:

# towScreenConfirmDestinationLabel
source: Destination:
ar: مكان الوصول:

# towScreenConfirmBaseCostLabel
source: Base cost:
ar: التكلفة الأساسية:

# towScreenConfirmKmTotalLabel
source: Total distance:
ar: إجمالي الكيلومترات:

# towScreenConfirmKmPriceLabel
source: Price per km:
ar: سعر الكيلو:

# towScreenConfirmKmCostLabel
source: Distance cost:
ar: تكلفة الكيلومترات:

# towScreenConfirmTotalLabel
source: Total service cost:
ar: إجمالي الخدمة:

# towScreenConfirmVehicleLabel
source: Vehicle:
ar: المركبة:

# towScreenConfirmPlateLabel
source: Plate:
ar: اللوحة:

# towScreenConfirmProblemLabel
source: Description:
ar: الوصف:

# towScreenConfirmPhoneLabel
source: Phone:
ar: رقم التليفون:

# towScreenDialogCancelButton
source: Cancel
ar: إلغاء

# towScreenDialogConfirmButton
source: Confirm
ar: تأكيد

# towScreenRequestSentTitle
source: Tow request sent
ar: تم إرسال طلب السحب

# towScreenRequestSentBodyPrefix
source: Your request has been sent to:
ar: تم إرسال طلبك إلى شركة:

# towScreenCompanyPhoneLabel
source: Company phone number:
ar: رقم التواصل مع الشركة:

# towScreenCallCompanyButton
source: Call company
ar: اتصال بالشركة

# towScreenCallErrorSnack
source: Could not open dialer
ar: تعذّر فتح شاشة الاتصال

# towScreenNoCompanyPhoneHint
source: No phone number is registered for this company. Please contact them later through the app.
ar: لم يتم تسجيل رقم هاتف للشركة، رجاءً تواصل معهم من خلال التطبيق لاحقاً.

# towScreenCloseButton
source: Close
ar: إغلاق

# towScreenSendErrorSnack
source: Failed to send request:
ar: تعذر إرسال الطلب:

# towScreenStepsStep1
source: Set location
ar: تحديد موقعي

# towScreenStepsStep2
source: Choose company
ar: اختيار شركة

# towScreenStepsStep3
source: Vehicle details
ar: بيانات المركبة

# towScreenStepsStep4
source: Confirm request
ar: تأكيد الطلب

# towScreenLocationPendingWarning
source: Your location is not set yet, use "Use my location" or pick from the map.
ar: لم يتم تحديد موقعك بعد، استخدم زر "موقعي الحالي" أو اختر من الخريطة.

# towScreenLocationReadyMessage
source: Your location has been set successfully.
ar: تم تحديد موقعك بنجاح.

# towScreenCurrentLocationSectionTitle
source: My current location
ar: موقعي الحالي

# towScreenCurrentCoordsLabel
source: Current coordinates
ar: الإحداثيات الحالية

# towScreenUseMyLocationButton
source: Use my location
ar: استخدم موقعي الحالي

# towScreenPickFromMapButton
source: Choose from map
ar: اختيار من الخريطة

# towScreenSelectedCompanyPrefix
source: Selected company:
ar: الشركة المختارة:

# towScreenSelectedCompanyDistancePrefix
source: Distance to company:
ar: المسافة للشركة:

# towScreenSelectedCompanyBaseCostPrefix
source: Base service:
ar: خدمة أساسية:

# towScreenSelectedCompanyKmPricePrefix
source: Price per km:
ar: سعر الكيلو:

# towScreenSelectedCompanyChangeButton
source: Change
ar: تغيير

# towScreenSelectedCompanyHintNoLocation
source: After setting your location, we will suggest the nearest tow company automatically.
ar: بعد تحديد موقعك، سنقترح أقرب شركة سحب تلقائياً.

# towScreenSelectedCompanyHintChoose
source: Choose the tow company that suits you from the list.
ar: اختر شركة السحب المناسبة لك من قائمة الشركات.

# towScreenSelectedCompanyShowCompaniesButton
source: Show companies
ar: عرض الشركات

# towScreenDestinationSectionTitle
source: Destination
ar: مكان الوصول

# towScreenDestinationAddressLabel
source: Address (optional)
ar: العنوان (اختياري)

# towScreenDestinationAddressHint
source: Enter the address or pick it from the map
ar: اكتب العنوان أو اختاره من الخريطة

# towScreenDestinationMapButton
source: Map
ar: خريطة

# towScreenDestinationOptionalHint
source: You can leave the destination empty and coordinate directly with the driver by phone.
ar: يمكن ترك مكان الوصول فارغًا والتنسيق مع السائق تليفونيًا.

# towScreenCostsSectionTitle
source: Service costs
ar: تكاليف الخدمة

# towScreenCostsBaseLabel
source: Base cost
ar: التكلفة الأساسية

# towScreenCostsKmTotalLabel
source: Total distance (to company + to destination)
ar: إجمالي الكيلومترات (للشركة + للوصول)

# towScreenCostsKmPriceLabel
source: Price per km
ar: سعر الكيلو

# towScreenCostsKmCostLabel
source: Distance cost
ar: تكلفة الكيلومترات

# towScreenCostsTotalLabel
source: Total service cost
ar: إجمالي الخدمة

# towScreenVehicleSectionTitle
source: Vehicle information
ar: معلومات المركبة

# towScreenVehicleTypeLabel
source: Make and model
ar: النوع والطراز

# towScreenVehicleTypeHint
source: Example: Honda Civic
ar: مثال: هوندا سيفيك

# towScreenRequiredFieldError
source: This field is required
ar: هذا الحقل مطلوب

# towScreenPlateLabel
source: License plate
ar: رقم اللوحة

# towScreenPlateHint
source: Example: ABC-1234
ar: مثال: ABC-1234

# towScreenProblemLabel
source: Problem description
ar: وصف المشكلة

# towScreenProblemHint
source: Briefly describe the problem… (optional)
ar: اكتب باختصار المشكلة… (اختياري)

# towScreenContactSectionTitle
source: Contact information
ar: معلومات التواصل

# towScreenPhoneLabel
source: Phone number
ar: رقم التليفون

# towScreenPhoneInvalidError
source: Please enter a valid phone number
ar: رجاءً أدخل رقمًا صحيحًا

# towScreenEtaTitle
source: Estimated arrival time
ar: الوقت المتوقع للوصول

# towScreenEtaValue
source: 15–25 minutes after request confirmation
ar: من 15 إلى 25 دقيقة بعد تأكيد الطلب

# towScreenSubmitButtonSending
source: Sending request...
ar: جارٍ إرسال الطلب...

# towScreenSubmitButtonLabel
source: Send request
ar: إرسال الطلب

# towScreenSubmitHint
source: Make sure your location is set and a tow company is selected before sending the request.
ar: تأكّد من تحديد موقعك واختيار شركة السحب قبل إرسال الطلب.

# towScreenFloatingNearestCompanies
source: Nearest companies
ar: أقرب الشركات

# bottomNavHome
source: Home
ar: الرئيسية

# bottomNavCategories
source: Categories
ar: التصنيفات

# bottomNavTow
source: Tow
ar: الونش

# bottomNavCart
source: Cart
ar: السلة

# bottomNavAccount
source: My account
ar: حسابي

# currencyEgpPerKm
source: EGP/km
ar: جنيه/كم

# commonCancel
source: Cancel
ar: إلغاء

# cartAppTitlePrefix
source: Shopping cart
ar: عربة التسوق

# cartAppTitleItemsSuffix
source: items
ar: عناصر

# cartItemDeleteTooltip
source: Remove item
ar: حذف العنصر

# orderSummaryTitle
source: Order summary
ar: ملخص الطلب

# orderSummarySubtotalPrefix
source: Items subtotal
ar: إجمالي المنتجات

# orderSummaryItemsSuffix
source: items
ar: عنصر

# orderSummaryShippingLabel
source: Shipping
ar: الشحن

# orderSummaryDiscountLabel
source: Discount
ar: الخصم

# orderSummaryGrandTotalLabel
source: Grand total
ar: الإجمالي النهائي

# orderSummaryCouponSectionTitle
source: Coupon code (optional)
ar: كود الخصم (اختياري)

# orderSummaryCouponFieldLabel
source: Enter coupon
ar: ادخل الكود
