Repository: AhmedAtaar/Team3_CAI3_SWD8_G1_AutoSpare
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Auto Spare
ar: قطع غيار السيارات

# brandProductsTitle
source: Brand products
ar: منتجات الماركة

# searchHint
source: Search by name or code
ar: ابحث بالاسم أو الكود

# sortNewest
source: Newest
ar: الأحدث

# sortPriceLow
source: Price: Low to High
ar: السعر من الأقل للأعلى

# sortPriceHigh
source: Price: High to Low
ar: السعر من الأعلى للأقل

# sortStockHigh
source: Stock: High to Low
ar: الأعلى في المخزون

# noProducts
source: No products found
ar: لا توجد منتجات

# login_title
source: Welcome back
ar: مرحبًا بعودتك

# login_subtitle
source: Sign in to access the app
ar: سجل الدخول للوصول إلى التطبيق

# login_email_label
source: Email
ar: البريد الإلكتروني

# login_password_label
source: Password
ar: كلمة المرور

# login_required
source: Required
ar: مطلوب

# login_remember_me
source: Remember me
ar: تذكرني

# login_button
source: Sign in
ar: تسجيل الدخول

# login_signup_button
source: Create a new account
ar: إنشاء حساب جديد

# login_with_google
source: Continue with Google
ar: الدخول باستخدام Google

# login_continue_as_guest
source: Continue as guest
ar: الدخول كزائر

# login_fix_errors_message
source: Please fix the errors in the form.
ar: من فضلك صحّح البيانات.

# login_invalid_credentials_message
source: Invalid login credentials
ar: بيانات الدخول غير صحيحة

# login_winch_not_approved_message
source: Winch account is not activated yet.
ar: حساب الونش غير مفعل بعد.

# login_guest_name
source: Guest
ar: زائر

# home_no_products_available
source: No products are currently available
ar: لا توجد منتجات متاحة حالياً

# home_no_search_results
source: No results match your search
ar: لا توجد نتائج مطابقة لبحثك

# home_search_hint
source: Search for a part...
ar: ابحث عن قطعة...

# home_sort_tooltip
source: Sort results
ar: ترتيب النتائج

# home_sort_newest
source: Newest first
ar: الأحدث أولاً

# home_sort_oldest
source: Oldest first
ar: الأقدم أولاً

# home_sort_price_low
source: Price: Low to High
ar: السعر: من الأقل

# home_sort_price_high
source: Price: High to Low
ar: السعر: من الأعلى

# home_sort_stock_high
source: Highest stock
ar: المخزون الأعلى

# nav_home
source: Home
ar: الرئيسية

# nav_categories
source: Categories
ar: التصنيفات

# nav_tow
source: Tow
ar: الونش

# nav_cart
source: Cart
ar: السلة

# nav_profile
source: My account
ar: حسابي

# common_language_toggle_tooltip
source: Change language
ar: تغيير اللغة

# signup_title
source: Create an account
ar: إنشاء حساب

# signup_role_buyer
source: Buyer
ar: مشتري

# signup_role_seller
source: Seller
ar: بائع

# signup_role_tow
source: Tow company
ar: ونش

# signup_email_label
source: Email
ar: الإيميل

# signup_password_label
source: Password
ar: كلمة المرور

# signup_password_confirm_label
source: Confirm password
ar: تأكيد كلمة المرور

# signup_name_label
source: Name
ar: الاسم

# signup_address_label
source: Address
ar: العنوان

# signup_phone_label
source: Phone number
ar: رقم التليفون

# signup_store_name_label
source: Store name
ar: اسم المتجر

# signup_cr_url_label
source: Commercial registration image URL (Drive/Link)
ar: رابط صورة السجل التجاري (Drive/Link)

# signup_tax_url_label
source: Tax card image URL (Drive/Link)
ar: رابط صورة البطاقة الضريبية (Drive/Link)

# signup_note_upload_docs
source: Note: You can upload files to Google Drive and send the links for review.
ar: ملحوظة: يمكنك رفع الملفات على Google Drive وإرسال الروابط للمراجعة.

# signup_company_name_label
source: Company name
ar: اسم الشركة

# signup_area_label
source: Coverage area
ar: المنطقة/التغطية

# signup_base_cost_label
source: Base service price (EGP)
ar: سعر الخدمة (جنيه)

# signup_price_per_km_label
source: Price per km (EGP)
ar: سعر الكيلو (جنيه)

# signup_lat_label
source: Latitude
ar: خط العرض (Latitude)

# signup_lng_label
source: Longitude
ar: خط الطول (Longitude)

# signup_pick_location_button
source: Pick location (current location / manual)
ar: تحديد الموقع (موقعي الآن / إدخال يدوي)

# signup_tow_cr_url_label
source: Commercial registration image URL (Drive/Link)
ar: رابط صورة السجل التجاري (Drive/Link)

# signup_tow_tax_url_label
source: Tax card image URL (Drive/Link)
ar: رابط صورة البطاقة الضريبية (Drive/Link)

# signup_password_too_short
source: At least 4 characters
ar: على الأقل 4 حروف

# signup_number_invalid
source: Please enter a valid number
ar: أدخل رقمًا صحيحًا

# signup_passwords_not_match
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# signup_banned_email_message
source: A new account cannot be created with this email. This account has been permanently banned by the administration.
ar: لا يمكن إنشاء حساب جديد بهذا البريد. تم حظر الحساب نهائيًا من قبل الإدارة.

# signup_tow_invalid_location_or_price
source: Please enter valid location/pricing data
ar: برجاء إدخال بيانات صحيحة للّوكيشن/الأسعار

# signup_tow_request_submitted
source: Tow company request submitted for review
ar: تم إرسال طلب شركة الونش للمراجعة

# signup_seller_request_submitted
source: Seller registration request submitted for review
ar: تم إرسال طلب تسجيل كبائع للمراجعة

# signup_buyer_created
source: Buyer account created successfully
ar: تم إنشاء حساب مشتري

# signup_generic_error
source: An error occurred while creating the account
ar: حدث خطأ أثناء إنشاء الحساب

# signup_email_already_in_use
source: An account already exists for this email
ar: الحساب موجود بالفعل لهذا الإيميل

# signup_weak_password
source: Weak password, please choose a stronger one
ar: كلمة المرور ضعيفة، برجاء اختيار كلمة أقوى

# signup_account_already_exists
source: Account already exists
ar: الحساب موجود بالفعل

# signup_submit_button
source: Create account
ar: إنشاء الحساب

# currency_egp
source: EGP
ar: ج.م

# common_invalid_url
source: Invalid URL
ar: رابط غير صالح

# common_image_load_failed
source: Failed to load image
ar: تعذر تحميل الصورة

# common_open_in_browser
source: Open in browser
ar: فتح في المتصفح

# common_preview
source: Preview
ar: معاينة

# admin_earnings_title
source: App earnings
ar: أرباح التطبيق

# admin_earnings_error_loading_orders
source: An error occurred while loading orders
ar: حدث خطأ أثناء تحميل الطلبات

# admin_earnings_no_completed_orders
source: There are no completed orders yet.
ar: لا توجد طلبات مكتملة حتى الآن

# admin_earnings_no_completed_in_range
source: There are no completed orders in the selected period. Try choosing another date range.
ar: لا توجد طلبات مكتملة في الفترة المحددة. جرّب اختيار فترة أخرى.

# admin_earnings_date_range_help
source: Select period
ar: اختر الفترة

# admin_earnings_date_range_confirm
source: Apply
ar: تم

# admin_earnings_date_range_cancel
source: Cancel
ar: إلغاء

# admin_earnings_current_period_label
source: Current display period
ar: الفترة الحالية للعرض

# admin_earnings_summary_title
source: Earnings summary for selected period
ar: ملخص الأرباح للفترة المختارة

# admin_earnings_summary_desc
source: All figures below are calculated from completed orders within the selected period only.
ar: كل الأرقام التالية محسوبة بناءً على الطلبات المكتملة داخل الفترة المحددة فقط.

# admin_earnings_total_app_fee_label
source: Total app earnings
ar: إجمالي أرباح التطبيق

# admin_earnings_change_period_button
source: Change period
ar: تغيير الفترة

# admin_earnings_chart_section_title
source: Earnings performance in the selected period
ar: أداء الأرباح في الفترة المختارة

# admin_earnings_chart_title
source: App earnings curve (selected period)
ar: منحنى أرباح التطبيق (حسب الفترة المختارة)

# admin_earnings_chart_no_data
source: Not enough data to draw a chart for this period.
ar: لا توجد بيانات كافية للرسم في هذه الفترة

# admin_earnings_period_orders_count_title
source: Completed orders in period
ar: عدد الطلبات في الفترة

# admin_earnings_period_total_paid_title
source: Total paid in period
ar: إجمالي المدفوع في الفترة

# admin_earnings_period_app_fee_title
source: App earnings in period
ar: أرباح التطبيق في الفترة

# admin_earnings_last_updated_prefix
source: Last updated:
ar: آخر تحديث:

# admin_earnings_total_paid_subtitle
source: Includes shipping, discount and app fee
ar: شاملة الشحن والخصم وعمولة التطبيق

# admin_earnings_total_items_title
source: Total items value
ar: إجمالي قيمة المنتجات

# admin_earnings_total_items_subtitle
source: Before shipping and discounts
ar: قبل الشحن والخصم

# admin_earnings_total_discount_title
source: Total discounts
ar: إجمالي الخصومات

# admin_earnings_total_app_fee_card_title
source: Total app earnings (estimated)
ar: إجمالي أرباح التطبيق (تقديري)

# admin_earnings_total_app_fee_subtitle
source: Calculated as 5% of final order prices
ar: محسوبة من أسعار الطلبات النهائية بنسبة ٥٪

# admin_profile_earnings_button
source: App earnings dashboard
ar: لوحة أرباح التطبيق

# admin_profile_manage_orders_button
source: Manage orders
ar: إدارة الطلبات

# admin_profile_manage_tow_orders_button
source: Manage tow requests
ar: إدارة طلبات الونش

# admin_profile_users_accounts_button
source: User accounts
ar: حسابات المستخدمين

# admin_profile_tab_products_review
source: Review products
ar: مراجعة المنتجات

# admin_profile_tab_sellers_approval
source: Approve sellers
ar: اعتماد البائعين

# admin_profile_tab_tow_approval
source: Approve tow companies
ar: اعتماد شركات الأوناش

# admin_profile_pending_sellers_title
source: Seller registration requests (Pending)
ar: طلبات تسجيل كبائع (Pending)

# admin_profile_pending_label_prefix
source: Pending:
ar: في الانتظار:

# admin_profile_no_pending_sellers
source: There are no seller requests under review.
ar: لا توجد طلبات بائعين قيد المراجعة

# admin_profile_products_panel_title
source: Products review panel
ar: لوحة مراجعة المنتجات

# admin_profile_no_pending_products
source: There are no products under review.
ar: لا توجد عناصر قيد المراجعة

# admin_profile_uploaded_docs_title
source: Uploaded documents:
ar: المستندات المرفوعة:

# admin_profile_rejected_with_reason_prefix
source: Rejected:
ar: مرفوض:

# admin_tow_requests_pending_title
source: Tow companies requests (Pending)
ar: طلبات شركات الونش (Pending)

# admin_tow_requests_no_pending
source: There are no tow company requests under review.
ar: لا توجد طلبات قيد المراجعة

# admin_tow_requests_account_owner_label
source: Account owner:
ar: صاحب الحساب:

# admin_tow_requests_service_price_prefix
source: Base service price:
ar: سعر الخدمة:

# admin_tow_requests_price_per_km_prefix
source: Price per km:
ar: سعر الكيلو:

# admin_tow_requests_location_label
source: Location (lat, lng):
ar: الموقع (خط العرض، خط الطول):

# admin_common_cancel
source: Cancel
ar: إلغاء

# admin_common_reject
source: Reject
ar: رفض

# admin_common_approve
source: Approve
ar: موافقة

# admin_products_error_loading
source: An error occurred while loading products
ar: حدث خطأ أثناء تحميل المنتجات

# admin_products_approve_success_prefix
source: Approved
ar: تمت الموافقة على

# admin_products_update_failed_prefix
source: Update failed:
ar: فشل في التحديث:

# admin_products_reject_dialog_title
source: Reject product
ar: رفض المنتج

# admin_products_reject_reason_label
source: Rejection reason
ar: سبب الرفض

# admin_products_reject_reason_hint
source: Rejection reason (optional)
ar: سبب الرفض (اختياري)

# admin_products_reject_reason_default
source: Not specified
ar: غير مُحدد

# admin_products_rejected_with_reason_prefix
source: Rejected
ar: تم رفض

# admin_products_label_id
source: ID
ar: رقم

# admin_products_label_seller
source: Seller
ar: البائع

# admin_products_label_brand
source: Brand
ar: البراند

# admin_products_label_model
source: Model
ar: الموديل

# admin_products_label_years
source: Years
ar: السنوات

# admin_products_label_stock
source: Stock
ar: المخزون

# admin_orders_title
source: Manage orders
ar: إدارة الطلبات

# admin_tow_orders_title
source: Manage tow requests
ar: إدارة طلبات الونش

# admin_tow_orders_no_requests
source: There are no tow requests yet.
ar: لا توجد طلبات ونش حتى الآن

# admin_tow_orders_status_cancelled_by_user_suffix
source: • Cancelled by customer
ar: • أُلغي بواسطة المشتري

# admin_tow_orders_status_cancelled_by_company_suffix
source: • Cancelled by company
ar: • أُلغي بواسطة الشركة

# admin_tow_orders_company_prefix
source: Company:
ar: الشركة:

# admin_tow_orders_total_cost_prefix
source: Total:
ar: إجمالي:

# admin_tow_orders_vehicle_label
source: Vehicle:
ar: المركبة:

# admin_tow_orders_plate_label
source: Plate:
ar: اللوحة:

# admin_tow_orders_customer_phone_label
source: Customer phone:
ar: تليفون العميل:

# admin_tow_orders_cancel_reason_title
source: Cancellation reason (customer):
ar: سبب الإلغاء (المشتري):

# admin_tow_orders_cancel_date_prefix
source: Cancellation date:
ar: تاريخ الإلغاء:

# brand_products_results_count_prefix
source: Results:
ar: عدد النتائج:

# admin_users_title
source: User accounts
ar: حسابات المستخدمين

# admin_users_tab_buyers
source: Buyer accounts
ar: حسابات المشترين

# admin_users_tab_sellers
source: Seller accounts
ar: حسابات البائعين

# admin_users_tab_winches
source: Tow accounts
ar: حسابات الأوناش

# admin_users_no_buyer_accounts
source: There are no buyer accounts.
ar: لا توجد حسابات مشترين

# admin_users_no_seller_accounts
source: There are no seller accounts.
ar: لا توجد حسابات بائعين

# admin_users_no_winch_accounts
source: There are no tow accounts.
ar: لا توجد حسابات أوناش

# admin_users_status_banned
source: Permanently banned
ar: محظور نهائياً

# admin_users_status_active
source: Active
ar: نشط

# admin_users_status_frozen
source: Frozen / Inactive
ar: مجمّد / غير مفعل

# admin_users_no_name
source: No name
ar: بدون اسم

# admin_users_store_label
source: Store:
ar: المتجر:

# admin_users_freeze
source: Freeze
ar: تجميد

# admin_users_unfreeze
source: Unfreeze
ar: إلغاء التجميد

# admin_users_unban_and_activate
source: Unban / Activate
ar: إلغاء الحظر / تفعيل

# admin_users_permanent_ban_button
source: Permanent ban
ar: حظر نهائي

# admin_users_permanent_ban_dialog_title
source: Confirm permanent ban
ar: تأكيد الحظر النهائي

# admin_users_permanent_ban_dialog_body_prefix
source: Are you sure you want to permanently ban
ar: هل أنت متأكد من حظر

# admin_users_permanent_ban_dialog_body_suffix
source: ? The user will not be able to use this account or create a new one with the same email.
ar: نهائياً؟\nلن يستطيع استخدام الحساب أو إنشاء حساب جديد بنفس البريد.

# admin_users_permanent_ban_confirm
source: Confirm ban
ar: تأكيد الحظر

# buyer_profile_tab_my_orders
source: My orders
ar: مشترياتي

# buyer_profile_tab_tow_requests
source: Tow requests
ar: طلبات الونش

# buyer_profile_go_shopping_button
source: Go shopping
ar: اذهب للتسوق

# buyer_tow_cancel_dialog_title
source: Cancel tow request
ar: إلغاء طلب الونش

# buyer_tow_cancel_reason_label
source: Cancellation reason (optional)
ar: سبب الإلغاء (اختياري)

# buyer_tow_cancel_reason_hint
source: Example: company is late / I managed on my own...
ar: مثال: الشركة اتأخرت / اتصرفّت بنفسي...

# buyer_tow_cancel_confirm_button
source: Confirm cancellation
ar: تأكيد الإلغاء

# buyer_tow_cancel_success_message
source: Tow request cancelled successfully
ar: تم إلغاء طلب الونش بنجاح

# buyer_tow_cancel_error_prefix
source: Failed to cancel request:
ar: تعذّر إلغاء الطلب:

# buyer_tow_no_requests_message
source: You have no tow requests yet.
ar: لا توجد طلبات سحب حتى الآن

# buyer_tow_status_new_suffix
source: (new)
ar: (جديد)

# buyer_tow_cancel_button
source: Cancel request
ar: إلغاء الطلب

# cart_title
source: Shopping cart
ar: عربة التسوق

# cart_empty_title
source: Your cart is empty
ar: عربة التسوق فارغة

# cart_empty_message
source: Cart is empty
ar: السلة فارغة

# cart_login_required_message
source: Please sign in first
ar: من فضلك قم بتسجيل الدخول أولاً

# cart_enter_name_message
source: Please enter customer name
ar: من فضلك أدخل اسم العميل

# cart_enter_address_message
source: Please enter address
ar: من فضلك أدخل العنوان

# cart_enter_phone_message
source: Please enter phone number
ar: من فضلك أدخل رقم التليفون

# cart_quantity_exceeds_stock_prefix
source: You cannot order more than available in stock
ar: لا يمكنك طلب أكثر من المتاح في المخزون

# cart_coupon_enter_code_message
source: Please enter the coupon code
ar: من فضلك أدخل كود الخصم

# cart_coupon_invalid_message
source: Invalid coupon code
ar: كود خصم غير صالح

# cart_coupon_not_usable_message
source: This coupon is inactive or expired
ar: هذا الكود غير مفعّل أو منتهي الصلاحية

# cart_coupon_seller_mismatch_message
source: No items in cart from the seller of this coupon
ar: لا توجد منتجات في السلة من البائع صاحب هذا الكود

# cart_coupon_applied_prefix
source: Coupon applied:
ar: تم تطبيق كود الخصم:

# cart_coupon_apply_error_prefix
source: Error applying coupon:
ar: حصل خطأ أثناء تطبيق الكود:

# cart_customer_section_title
source: Customer details
ar: بيانات العميل

# cart_customer_name_label
source: Name
ar: الاسم

# cart_customer_address_label
source: Address
ar: العنوان

# cart_customer_phone_label
source: Phone
ar: رقم التليفون

# cart_customer_alt_phone_label
source: Alternate phone
ar: رقم آخر للتواصل

# cart_delivery_section_title
source: Delivery location (optional)
ar: موقع التسليم (اختياري)

# cart_delivery_input_label
source: Address or coordinates
ar: العنوان أو الإحداثيات

# cart_delivery_current_location_button
source: My current location
ar: موقعي الحالي

# cart_delivery_pick_on_map_button
source: Pick from map
ar: اختيار من الخريطة

# cart_delivery_fees_note
source: Delivery fees may vary based on quantity and package size.
ar: قد تتغير رسوم التوصيل حسب الكمية وحجم البضائع.

# cart_delivery_payment_note
source: Currently available payment method: Cash on delivery.
ar: طريقة الدفع المتاحة حالياً: نقدي عند الاستلام.

# cart_electronic_payment_title
source: Electronic payment
ar: الدفع الإلكتروني

# cart_electronic_payment_subtitle
source: Coming soon – cards & e-wallets
ar: قريباً – بطاقات / محافظ إلكترونية

# cart_electronic_payment_soon_chip
source: Soon
ar: قريباً

# cart_electronic_payment_soon_message
source: Electronic payment will be available soon.
ar: ميزة الدفع الإلكتروني سيتم تفعيلها قريباً.

# cart_confirm_dialog_title
source: Confirm order
ar: تأكيد الطلب

# cart_confirm_customer_label
source: Customer:
ar: العميل:

# cart_confirm_address_label
source: Address:
ar: العنوان:

# cart_confirm_phone_label
source: Phone:
ar: رقم التليفون:

# cart_confirm_delivery_location_label
source: Delivery location:
ar: موقع التسليم:

# cart_confirm_items_count_label
source: Items count:
ar: عدد العناصر:

# cart_confirm_items_total_label
source: Items total:
ar: إجمالي المنتجات:

# cart_confirm_shipping_label
source: Shipping:
ar: الشحن:

# cart_confirm_discount_label
source: Discount: -
ar: الخصم: -

# cart_confirm_grand_total_label
source: Grand total:
ar: الإجمالي النهائي:

# cart_confirm_note_label
source: Note:
ar: ملاحظة:

# cart_confirm_button
source: Confirm
ar: تأكيد

# cart_order_created_prefix
source: Order created
ar: تم إنشاء الطلب

# cart_cancel_all_items_message
source: All items in cart have been cleared
ar: تم إلغاء جميع العناصر في السلة

# categories_error_loading
source: An error occurred while loading categories
ar: حدث خطأ أثناء تحميل التصنيفات

# categories_search_hint
source: Search for parts, brands, models...
ar: ابحث عن قطع، علامات تجارية، موديلات...

# categories_title
source: Categories
ar: التصنيفات

# categories_subtitle
source: Browse parts by brand
ar: تصفح القطع حسب الماركة

# map_picker_title
source: Choose destination
ar: اختيار مكان الوصول

# map_picker_search_hint
source: Search for an address or place...
ar: ابحث عن عنوان أو مكان...

# map_picker_no_results_message
source: No results were found for this search. Try adjusting the address or checking your internet connection.
ar: لا توجد نتائج لهذا البحث حاليًا. جرّب تعديل العنوان أو التأكد من اتصال الإنترنت.

# map_picker_pending_address
source: Resolving address…
ar: جارِ تحديد العنوان…

# map_picker_confirm_button
source: Choose this location
ar: اختيار هذا المكان

# product_details_title
source: Product details
ar: تفاصيل المنتج

# product_details_added_to_cart_message
source: Product added to cart
ar: تمت إضافة المنتج إلى السلة

# product_details_brand_label_prefix
source: Brand:
ar: الماركة:

# product_details_model_label_prefix
source: Model:
ar: الموديل:

# product_details_years_label_prefix
source: Years:
ar: السنوات:

# product_details_stock_label_prefix
source: Available stock:
ar: المخزون المتاح:

# product_details_price_label_prefix
source: Price:
ar: السعر:

# product_details_add_to_cart_button
source: Add to cart
ar: أضف للسلة

# product_details_buy_now_button
source: Buy now
ar: شراء الآن

# product_details_seller_label_prefix
source: Seller:
ar: البائع:

# profile_app_bar_title
source: Profile
ar: الملف الشخصي

# profile_winch_requests_button_tooltip
source: Manage tow requests (service provider panel)
ar: إدارة طلبات الونش (لوحة مقدم الخدمة)

# profile_winch_requests_button_label
source: Tow requests
ar: طلبات الونش

# profile_logout_tooltip
source: Sign out
ar: تسجيل الخروج

# profile_login_tooltip
source: Sign in
ar: تسجيل الدخول

# profile_greeting_prefix
source: Welcome
ar: مرحباً

# profile_role_label_admin
source: Admin (review only)
ar: أدمن (مراجعة فقط)

# profile_role_label_seller
source: Seller
ar: بائع

# profile_role_label_buyer
source: Buyer
ar: مشتري

# profile_role_label_winch
source: Tow service provider
ar: مقدم خدمة سحب السيارات

# profile_role_label_unknown
source: Unknown
ar: غير معروف

# profile_mode_admin_label
source: Admin dashboard
ar: لوحة إدارة

# profile_mode_winch_label
source: Tow service provider • Can shop from the store
ar: مقدم خدمة سحب السيارات • يمكنه الشراء من المتجر

# profile_mode_prefix
source: Mode:
ar: الوضع:

# profile_mode_seller_label
source: Seller
ar: بائع

# profile_mode_buyer_label
source: Buyer
ar: مشتري

# profile_role_chip_label_prefix
source: Account role:
ar: دور الحساب:

# profile_switch_to_buyer_button
source: Switch to buyer
ar: التبديل إلى مشتري

# profile_switch_to_seller_button
source: Switch back to seller
ar: الرجوع إلى بائع

# profile_switched_to_buyer_message
source: Switched to buyer mode
ar: تم التبديل إلى وضع مشتري

# profile_switched_to_seller_message
source: Switched back to seller mode
ar: تم الرجوع إلى وضع بائع

# profile_winch_hint_text
source: This account is registered as a tow service provider, and you can also buy spare parts from the store using this account.
ar: هذا الحساب مسجّل كمقدّم خدمة سحب سيارات، ويمكنك أيضاً شراء قطع الغيار من المتجر بنفس هذا الحساب.

# profile_pure_buyer_hint_text
source: This account is registered as buyer only.
ar: هذا الحساب مسجّل كمشتري فقط.

# seller_coupons_title
source: Discount coupons
ar: أكواد الخصم

# seller_coupons_help_text
source: Create and manage discount coupons for your store.
ar: قم بإنشاء وإدارة أكواد الخصم الخاصة بمتجرك.

# seller_coupons_create_button
source: Create new coupon
ar: إنشاء كود خصم جديد

# seller_coupons_empty_message
source: There are no coupons yet.
ar: لا توجد أكواد خصم حالياً

# seller_coupons_status_expired
source: Expired
ar: منتهي

# seller_coupons_status_active
source: Active
ar: مفعّل

# seller_coupons_status_inactive
source: Inactive
ar: موقوف

# seller_coupons_discount_percent_prefix
source: Discount:
ar: نسبة الخصم:

# seller_coupons_expires_at_prefix
source: Expires at:
ar: ينتهي في:

# seller_coupons_no_expiry
source: No expiry date
ar: بدون تاريخ انتهاء

# seller_coupons_toggle_tooltip_activate
source: Activate coupon
ar: تفعيل الكود

# seller_coupons_toggle_tooltip_deactivate
source: Deactivate coupon
ar: إيقاف الكود

# seller_coupons_delete_tooltip
source: Delete coupon
ar: حذف الكود

# seller_coupons_delete_dialog_title
source: Delete coupon
ar: حذف الكود

# seller_coupons_delete_dialog_message_prefix
source: Are you sure you want to delete coupon
ar: هل أنت متأكد من حذف الكود

# seller_coupons_delete_dialog_cancel_button
source: Cancel
ar: إلغاء

# seller_coupons_delete_dialog_confirm_button
source: Delete
ar: حذف
